OU-or-RAN/smart-home-assistant/sdkconfig.defaults
# 在项目根目录执行
cd F:\storage1\VScode\VsProj\smart-home-edge-assistant

# 创建 sdkconfig.defaults（脱敏版本）
@'
# ESP32-S3 Default Configuration
# ESP-IDF 5.3.1
# 复制为 sdkconfig 后执行: idf.py build

# ============================================
# 目标芯片
# ============================================
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# ============================================
# CPU 频率
# ============================================
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_160=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=160

# ============================================
# 内存
# ============================================
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_USE_MALLOC=y

# ============================================
# WiFi（需在 sdkconfig 或 menuconfig 中配置）
# ============================================
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y

# 以下需在本地配置（不要提交到Git）
# CONFIG_EXAMPLE_WIFI_SSID="your-ssid"
# CONFIG_EXAMPLE_WIFI_PASSWORD="your-password"

# ============================================
# MQTT
# ============================================
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y

# 以下需在本地配置
# CONFIG_BROKER_URL="mqtt://your-broker-ip"

# ============================================
# 日志
# ============================================
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL=3
CONFIG_LOG_COLORS=y

# ============================================
# FreeRTOS
# ============================================
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536

# ============================================
# 分区表
# ============================================
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# ============================================
# 编译器
# ============================================
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
'@ 